; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg chair-base chair-leg chair-seat shelf-frame shelf-box desk-plane desk-drawer - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
        (connected-to ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
        (affords-connecting ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
        (affords-connecting-to ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)

    (:action connect-to
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-connecting ?tp) (part-of ?th ?tt) (affords-connecting-to ?tl ?th ?tt))
		:effect (and (connected-to ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)
	(:objects
		column - shelf-frame
		box1 box2 box3 box4 box5 - shelf-box
		column-base box1-base box2-base box3-base box4-base box5-base - handle-part
		box1-connect box2-connect box3-connect box4-connect box5-connect - action-part
		column-connector1 column-connector2 column-connector3 column-connector4 column-connector5 - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor column)
		(on-floor box1)
		(on-floor box2)
		(on-floor box3)
		(on-floor box4)
		(on-floor box5)

		(clear column)
		(clear box1)
		(clear box2)
		(clear box3)
		(clear box4)
		(clear box5)

		(empty robot-gripper)

		(part-of column-base column)
		(part-of box1-base box1)
		(part-of box2-base box2)
		(part-of box3-base box3)
		(part-of box4-base box4)
		(part-of box5-base box5)
        (part-of box1-connect box1)
		(part-of box2-connect box2)
		(part-of box3-connect box3)
		(part-of box4-connect box4)
		(part-of box5-connect box5)

		(part-of column-connector1 column)
        (part-of column-connector2 column)
        (part-of column-connector3 column)
        (part-of column-connector4 column)
        (part-of column-connector5 column)

		(affords-picking column-base)
		(affords-picking box1-base)
		(affords-picking box2-base)
        (affords-picking box3-base)
		(affords-picking box4-base)
		(affords-picking box5-base)

		(affords-connecting box1-connect)
        (affords-connecting box2-connect)
        (affords-connecting box3-connect)
        (affords-connecting box4-connect)
        (affords-connecting box5-connect)
        
        (affords-connecting-to box1 column-connector1 column)
        (affords-connecting-to box2 column-connector2 column)
        (affords-connecting-to box3 column-connector3 column)
        (affords-connecting-to box4 column-connector4 column)
        (affords-connecting-to box5 column-connector5 column)
	)

	(:goal (and (connected-to box1 column)
				(connected-to box2 column)
                (connected-to box3 column)
                (connected-to box4 column)
                (connected-to box5 column)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper box5-base box5)
   deleted: (clear box5) (empty robot-gripper) (on-floor box5)
   added: (in-hand robot-gripper box5)
   goals met: 0 of 5
2. (connect-to robot-gripper box5-connect box5 column-connector5 column)
   deleted: (in-hand robot-gripper box5)
   added: (connected-to box5 column) (clear box5) (empty robot-gripper)
   goals met: 1 of 5
3. (pick-up-from-floor robot-gripper box2-base box2)
   deleted: (clear box2) (empty robot-gripper) (on-floor box2)
   added: (in-hand robot-gripper box2)
   goals met: 1 of 5
4. (connect-to robot-gripper box2-connect box2 column-connector2 column)
   deleted: (in-hand robot-gripper box2)
   added: (connected-to box2 column) (clear box2) (empty robot-gripper)
   goals met: 2 of 5
5. (pick-up-from-floor robot-gripper box4-base box4)
   deleted: (clear box4) (empty robot-gripper) (on-floor box4)
   added: (in-hand robot-gripper box4)
   goals met: 2 of 5
6. (connect-to robot-gripper box4-connect box4 column-connector4 column)
   deleted: (in-hand robot-gripper box4)
   added: (connected-to box4 column) (clear box4) (empty robot-gripper)
   goals met: 3 of 5
7. (pick-up-from-floor robot-gripper box1-base box1)
   deleted: (clear box1) (empty robot-gripper) (on-floor box1)
   added: (in-hand robot-gripper box1)
   goals met: 3 of 5
8. (connect-to robot-gripper box1-connect box1 column-connector1 column)
   deleted: (in-hand robot-gripper box1)
   added: (connected-to box1 column) (clear box1) (empty robot-gripper)
   goals met: 4 of 5
9. (pick-up-from-floor robot-gripper box3-base box3)
   deleted: (clear box3) (empty robot-gripper) (on-floor box3)
   added: (in-hand robot-gripper box3)
   goals met: 4 of 5
10. (connect-to robot-gripper box3-connect box3 column-connector3 column)
   deleted: (in-hand robot-gripper box3)
   added: (connected-to box3 column) (clear box3) (empty robot-gripper)
   goals met: 5 of 5
